Cantonaaa/BLE-daikin/ESP/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_16m.csv"
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_LWIP_ENABLE=y

# Disable WiFi+BT coexistence to avoid missing binary lib
CONFIG_ESP_COEX_ENABLED=n
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n

# ESP-SR wake word: 你好小智
CONFIG_SR_WN_WN9_NIHAOXIAOZHI_TTS=y
# ESP-SR command recognition: MN6 Chinese
CONFIG_SR_MN_CN_MULTINET6_QUANT=y
